; domain
(define (domain furniture-assembly)
	(:requirements :strips :typing)
	(:types
		tool tool-part - object
		table-top table-leg chair-base chair-leg chair-seat shelf-frame shelf-box desk-plane desk-drawer - tool
		handle-part action-part - tool-part
		gripper
	)

	(:predicates
		(on ?t1 - tool ?t2 - tool)
		(on-floor ?t - tool)
		(clear ?t - tool)
		(empty ?g - gripper)
		(in-hand ?g - gripper ?t - tool)
		(screwed-into ?t - tool ?s - tool)
        (connected-to ?t - tool ?s - tool)
		(part-of ?tp - tool-part ?t - tool)
		(affords-picking ?tp - handle-part)
		(affords-screwing ?tp - action-part)
        (affords-connecting ?tp - action-part)
		(affords-hammering ?tp - action-part)
		(affords-turning-on ?tp - action-part)
		(affords-turning-off ?tp - action-part)
		(affords-placing ?t - tool)
		(affords-screwing-into ?s - tool ?tp - tool-part ?t - tool)
        (affords-connecting-to ?s - tool ?tp - tool-part ?t - tool)
	)

	(:action pick-up-from-tool
		:parameters (?g - gripper ?tp - handle-part ?t - tool ?s - tool)
		:precondition (and (clear ?t) (empty ?g) (on ?t ?s) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (clear ?s) (not (clear ?t)) (not (empty ?g)) (not (on ?t ?s)))
	)

	(:action pick-up-from-floor
		:parameters (?g - gripper ?tp - handle-part ?t - tool)
		:precondition (and (clear ?t) (empty ?g) (on-floor ?t) (part-of ?tp ?t) (affords-picking ?tp))
		:effect (and (in-hand ?g ?t) (not (clear ?t)) (not (empty ?g)) (not (on-floor ?t)))
	)

	(:action put-on-floor
		:parameters (?g - gripper ?t - tool)
		:precondition (and (in-hand ?g ?t) (affords-placing ?t))
		:effect (and (on-floor ?t) (clear ?t) (empty ?g) (not (in-hand ?g ?t)))
	)

	(:action screw-into
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-screwing ?tp) (part-of ?th ?tt) (affords-screwing-into ?tl ?th ?tt))
		:effect (and (screwed-into ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)

    (:action connect-to
		:parameters (?g - gripper ?tp - action-part ?tl - tool ?th - tool-part ?tt - tool)
		:precondition (and (in-hand ?g ?tl) (part-of ?tp ?tl) (affords-connecting ?tp) (part-of ?th ?tt) (affords-connecting-to ?tl ?th ?tt))
		:effect (and (connected-to ?tl ?tt) (clear ?tl) (empty ?g) (not (in-hand ?g ?tl)))
	)
)

; problem
(define (problem table-assembly-full)
	(:domain furniture-assembly)
	(:objects
		left-plane right-plane top-plane - desk-plane
		drawer - desk-drawer
		left-plane-base right-plane-base top-plane-base drawer-base - handle-part
		left-plane-connect right-plane-connect drawer-connect - action-part
		top-plane-connector1 top-plane-connector2 top-plane-connector3 - tool-part
		robot-gripper - gripper
	)

	(:init
		(on-floor left-plane)
		(on-floor right-plane)
		(on-floor top-plane)
        (on-floor drawer)

		(clear left-plane)
		(clear right-plane)
		(clear top-plane)
        (clear drawer)

		(empty robot-gripper)

		(part-of left-plane-base left-plane)
		(part-of right-plane-base right-plane)
		(part-of top-plane-base top-plane)
        (part-of drawer-base drawer) 

		(part-of left-plane-connect left-plane)
		(part-of right-plane-connect right-plane)
		(part-of drawer-connect drawer)

        (part-of top-plane-connector1 top-plane)
        (part-of top-plane-connector2 top-plane)
        (part-of top-plane-connector3 top-plane)

		(affords-picking left-plane-base)
		(affords-picking right-plane-base)
		(affords-picking top-plane-base)
        (affords-picking drawer-base)

		(affords-connecting left-plane-connect)
        (affords-connecting right-plane-connect)
        (affords-connecting drawer-connect)
		(affords-connecting-to left-plane top-plane-connector1 top-plane)
        (affords-connecting-to right-plane top-plane-connector2 top-plane)
        (affords-connecting-to drawer top-plane-connector3 top-plane)
	)

	(:goal (and (connected-to left-plane top-plane)
				(connected-to right-plane top-plane)
                (connected-to drawer top-plane)
		   	)
	)
)

; plan
1. (pick-up-from-floor robot-gripper left-plane-base left-plane)
   deleted: (clear left-plane) (empty robot-gripper) (on-floor left-plane)
   added: (in-hand robot-gripper left-plane)
   goals met: 0 of 3
2. (connect-to robot-gripper left-plane-connect left-plane top-plane-connector1 top-plane)
   deleted: (in-hand robot-gripper left-plane)
   added: (connected-to left-plane top-plane) (clear left-plane) (empty robot-gripper)
   goals met: 1 of 3
3. (pick-up-from-floor robot-gripper right-plane-base right-plane)
   deleted: (clear right-plane) (empty robot-gripper) (on-floor right-plane)
   added: (in-hand robot-gripper right-plane)
   goals met: 1 of 3
4. (connect-to robot-gripper right-plane-connect right-plane top-plane-connector2 top-plane)
   deleted: (in-hand robot-gripper right-plane)
   added: (connected-to right-plane top-plane) (clear right-plane) (empty robot-gripper)
   goals met: 2 of 3
5. (pick-up-from-floor robot-gripper drawer-base drawer)
   deleted: (clear drawer) (empty robot-gripper) (on-floor drawer)
   added: (in-hand robot-gripper drawer)
   goals met: 2 of 3
6. (connect-to robot-gripper drawer-connect drawer top-plane-connector3 top-plane)
   deleted: (in-hand robot-gripper drawer)
   added: (connected-to drawer top-plane) (clear drawer) (empty robot-gripper)
   goals met: 3 of 3
